[
    {
        "title": "Terrahub",
        "summary": "Site web qui aide à collecter tout les objets du jeu video <i>Terraria</i> en sauvegardant les objets collectés dans la base de données locale IndexedDB.",
        "technologies": [
            "angular",
            "nestjs",
            "tailwind",
            "docker"
        ],
        "preview": "alltheitems.webp",
        "images": [
            "alltheitems.webp",
            "alltheitems2.webp"
        ],
        "detailed_description": "Le projet Terrahub est un site web qui aide à la collecte de plus de 5.000 objets dans le jeu vidéo Terraria.Les données sont initialement récupéré du jeu en requête cURL et sont ensuite transformés en fichier JSON. La génération de données des objets se fait sur le serveur en langage PHP, ou on récupère ces données à partir d'une base de données MongoDB. Les objets collectés sont stockés dans une base de données locale IndexedDB et ne disparaîtront pas lorsque l'utilisateur quittera la page. L'application permet la collecte, la filtration par objet collecté et une barre de recherche qui permet de retrouver un objet par son nom. ",
        "github": "https://github.com/ilyasmirnov03/terrahub-front"
    },
    {
        "title": "Musical Trainer",
        "summary": "Outil qui aide à l'apprentissage du solfège à travers l'identification des notes affichées aléatoirement sur la portée.",
        "technologies": [
            "react",
            "typescript"
        ],
        "preview": "musicaltrainer.webp",
        "images": [
            "musicaltrainer2.webp",
            "musicaltrainer3.webp"
        ],
        "detailed_description": "Musical Trainer est une application qui aide à s'entraîner au solfège de manière ludique. C'est mon premier projet personnel de développement web codé en React. Lorsque l'utilisateur clique sur le bouton du début du jeu, une note apparaît sur la portée. L'utilisateur doit ensuite identifier la note par rapport à son emplacement sur la portée. Si la note saisie ne correspond pas à la note affichée à la porte, le bouton devient rouge et la note reste sur la portée jusqu'au moment où l'utilisateur identifie la bonne note. Quand l'utilisateur identifie bien la note, le jeu continue en générant une autre note.",
        "github": "https://github.com/ilyasmirnov03/musical-trainer"
    }
]